Repository: hassanolaa/Halaqah-Qurania
Catalog: lib/l10n/intl_*.arb
Languages: ar

# name
source: Halaqah Qurania
ar: حلقه قرأنيه

source: Hello.
ar: .مرحبا

# createaac
source: Create Account
ar: سجل حساب جديد

source: Email
ar: الاميل الالكتروني

# entermail
source: Enter email
ar: ادخل حسابك الالكتروني

source: Password
ar: كلمه السر

source: Enter Password
ar: ادخل كلمه السر

# user
source: Hassan
ar: حسن

source: Quran
ar: القرأن

source: Hadith
ar: الحديث

source: Tasbeh
ar: تسابيح

source: Duaa
ar: الدعاء

source: Azkar
ar: الاذكار
